# DATA CLEANING AND PREPARATION

In [30]:
import pandas as pd
import numpy as np

In [31]:
## loading the data first ... 
df = pd.read_csv('created.csv')
print(df.columns)
print(df)

Index(['0', 'Zero', 'One', 'Two', 'Three'], dtype='object')
   0  Zero  One  Two  Three
0  0     0    1    2      3
1  1     4    5    6      7
2  2     8    9   10     11

In [32]:
float_data = pd.Series([1.2,-3.5,np.nan, 0]);
float_data.isna().sum()

np.int64(1)

In [33]:
data=pd.DataFrame([[1.,6.5,3.],[1.,np.nan,np.nan],
                  [np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

#### Dropping the Cols

In [34]:
# here is any particular row,col is NaN then in that case whole row is dropped !
data.dropna()

# here if only whole row is NaN in that case only the whole row is dropped !
data.dropna(how="all")

# dropping the col's instead of rows && how="all" specifies that if the while col is Nan in that case only we drop
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [35]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  0.168444       NaN       NaN
1  0.947192       NaN       NaN
2  0.523510       NaN  1.128268
3 -0.041874       NaN -1.121223
4  0.464240 -1.274999  0.701529
5 -0.519514  1.092141 -1.507265
6  1.315929  0.854970 -0.634428

In [36]:
# droping rows / cols only if below a specific threshold 

# thres specifies how many minimum non NaN rows are needed .. like suppose thresh is like 3 then that all the rows having more less than 3 non NaN are droped 
df.dropna(thresh=2)

# here axis = 1 specifies that rather than looking and deleting for rows .. we look for cols and delete them 
df.dropna(thresh=4, axis=1)

          0         2
0  0.168444       NaN
1  0.947192       NaN
2  0.523510  1.128268
3 -0.041874 -1.121223
4  0.464240  0.701529
5 -0.519514 -1.507265
6  1.315929 -0.634428

### Flling with Missing Values

In [37]:
df

          0         1         2
0  0.168444       NaN       NaN
1  0.947192       NaN       NaN
2  0.523510       NaN  1.128268
3 -0.041874       NaN -1.121223
4  0.464240 -1.274999  0.701529
5 -0.519514  1.092141 -1.507265
6  1.315929  0.854970 -0.634428

In [38]:
df.fillna(0)

          0         1         2
0  0.168444  0.000000  0.000000
1  0.947192  0.000000  0.000000
2  0.523510  0.000000  1.128268
3 -0.041874  0.000000 -1.121223
4  0.464240 -1.274999  0.701529
5 -0.519514  1.092141 -1.507265
6  1.315929  0.854970 -0.634428

In [39]:
# here we specify that we want to fill the col 1 with 0.5 and col 2 as 0.9 if there is NaN
df.fillna({1:0.5, 2:0.9})

          0         1         2
0  0.168444  0.500000  0.900000
1  0.947192  0.500000  0.900000
2  0.523510  0.500000  1.128268
3 -0.041874  0.500000 -1.121223
4  0.464240 -1.274999  0.701529
5 -0.519514  1.092141 -1.507265
6  1.315929  0.854970 -0.634428

##### ffill -> Forward Fill if a technique we use to fill the missing values and put the values of the previous row of that particular column in the current missing box .. so the problem here is .. suppose the first box is only NaN then in that case it is kept NaN only and not changed becz no previous values to forward fill it.

In [40]:
# here we are trying to forward fill it the missing values using forward fill (ffill) but since there is no numbers before the NaN hence forward fill fails 
df.ffill()

          0         1         2
0  0.168444       NaN       NaN
1  0.947192       NaN       NaN
2  0.523510       NaN  1.128268
3 -0.041874       NaN -1.121223
4  0.464240 -1.274999  0.701529
5 -0.519514  1.092141 -1.507265
6  1.315929  0.854970 -0.634428

In [41]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[3:, 2] = np.nan
df.iloc[4:, 0:2] = np.nan
print(df)
df.ffill()

          0         1         2
0 -0.497635 -1.718276 -0.972608
1 -1.174611  0.913192 -0.785851
2  1.918656 -1.284553 -0.908614
3 -0.157237  0.660133       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN
6       NaN       NaN       NaN

          0         1         2
0 -0.497635 -1.718276 -0.972608
1 -1.174611  0.913192 -0.785851
2  1.918656 -1.284553 -0.908614
3 -0.157237  0.660133 -0.908614
4 -0.157237  0.660133 -0.908614
5 -0.157237  0.660133 -0.908614
6 -0.157237  0.660133 -0.908614

In [42]:
# repeat only twice the same value
df.ffill(limit=2)

          0         1         2
0 -0.497635 -1.718276 -0.972608
1 -1.174611  0.913192 -0.785851
2  1.918656 -1.284553 -0.908614
3 -0.157237  0.660133 -0.908614
4 -0.157237  0.660133 -0.908614
5 -0.157237  0.660133       NaN
6       NaN       NaN       NaN

In [43]:
data= pd.DataFrame({"k1":["one","two"]*3+["two"],
                   "k2":[1,1,2,3,3,4,4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [44]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [45]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [46]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

#### here droping is based on subset .. like we check only for col k1 .. if col k1 repeats then we drop .. don't check for other cols

In [47]:
new_data = data.drop_duplicates(subset=['k1'])
print(new_data)
data

    k1  k2  v1
0  one   1   0
1  two   1   1

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [48]:
print(data)
new_data = data.drop_duplicates(subset=['k1','k2'], keep="last")
print("New data is this : \n",new_data)

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6
New data is this :
     k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [49]:
data=pd.Series([1.,-999.,2,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

#### replacing data

In [50]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [51]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [52]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [53]:
data = pd.DataFrame(np.arange(12).reshape(3,4), 
                    index=["Ohio","Colorado","New York"],
                    columns=["one","two","three","four"])
                    

print(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [54]:
print(data.index )
data.columns

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

Index(['one', 'two', 'three', 'four'], dtype='object')

In [55]:
def transform(x):
    return x.upper()

In [56]:
data.index =  data.index.map(transform)
x = data.index
print(x)
data

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [57]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three' : 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

## Combining and Merging DataSets

1. pandas.merge

Connect rows in DataFrames based on one or more keys

2. pandas.concat

Concatenate or stack objects together along an axis

3. combine_first

Splice together overlapping data to fill in miing values in one object with values from another

### BASIC

In [59]:
df1 = pd.DataFrame({"key" : ["b", "b", "a","c","a",'a',"b"], 
                    "data1" : pd.Series(range(7), dtype='int64')})
            
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [61]:
df2=pd.DataFrame({"key":["a","b","d"],
                "data2":pd.Series(range(3),dtype="Int64")})

df2

  key  data2
0   a      0
1   b      1
2   d      2

In [ ]:
pd.merge(df1, df2)

# 1. some key points .. so here merge merges the two dataset based on keys ... suppose df1 has a,b,c and df2 has a,b,d .. then after merging we will get only a,b becz these are something that is common. 
# 2. So suppose df1 has like 3 occurances of a and df2 has only 1 occurance of a in that case in the merged df there will be 3 a's only but for df2 the values will repeate .

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [74]:
df3= pd.DataFrame({"lkey":["b","b","a","c","a",'a',"b"],
                  "data1":pd.Series(range(7),dtype="Int64")})

df4=pd.DataFrame({"rkey":["a","b","d"],
                "data2":pd.Series(range(3),dtype="Int64")})

print(df3)
print(df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6
  rkey  data2
0    a      0
1    b      1
2    d      2

In [75]:
print(pd.merge(df3, df4, left_on='lkey', right_on='rkey'))

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [77]:
# here this thing raises Error as there is no same col to merge 
pd.merge(df3, df4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

#### thing to keep in mind !

1. if we want to merge to datasets we use merge and if they have smae col in that case we need not pass anything else as parameter just pd.merge(df1, df2) 
2. suppose there are col related but with different names in that case we need to pass left_on and right_on specifying the name of the col in left df and right df respectively !

### Outer Join 

here all the keys are taken care of .. not like only the common ones .. and suppose a key is missing from a df in that case we use < NA >

In [ ]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   a    2.0      0
1   a    4.0      0
2   a    5.0      0
3   b    0.0      1
4   b    1.0      1
5   b    6.0      1
6   c    3.0   <NA>
7   d    NaN      2

In [80]:
pd.merge(df3, df4, how='outer', left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    a      2    a      0
1    a      4    a      0
2    a      5    a      0
3    b      0    b      1
4    b      1    b      1
5    b      6    b      1
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [87]:
left=pd.DataFrame({"key1":["foo","foo","bar"],
                  "key2":["one","two","three"],
                 "lval":pd.Series([1,2,3],dtype='Int64')})

right=pd.DataFrame({"key1":["foo","foo","bar","bar"],
                    "key2":["one","one","one","two"],
                    "rval":pd.Series([4,5,6,7],dtype='Int64')})

print(left)
print("\n", right)

  key1   key2  lval
0  foo    one     1
1  foo    two     2
2  bar  three     3

   key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [88]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1   key2  lval  rval
0  bar    one  <NA>     6
1  bar  three     3  <NA>
2  bar    two  <NA>     7
3  foo    one     1     4
4  foo    one     1     5
5  foo    two     2  <NA>

### Left Join

here the df used first in case of pd.merge(df1,df2,how="left") is the left and the df2 is the right one .. we join right to left .. so all the keys in the left are there and the ones those are common to the left df key in right are joined

In [81]:
df1= pd.DataFrame({"key":["b","b","a","c","a","b"],
                  "data1":pd.Series(range(6),dtype="Int64")})

df2=pd.DataFrame({"key":["a","b","a","b","d"],
                "data2":pd.Series(range(5),dtype="Int64")})

print(df1)
print(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5
  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [82]:
df1.merge(df2,how='left')

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [86]:
pd.merge(left, right , on=['key1', 'key2'], how='left')

  key1   key2  lval  rval
0  foo    one     1     4
1  foo    one     1     5
2  foo    two     2  <NA>
3  bar  three     3  <NA>

### Inner Join 


-> here we take the cross product of the df .. like suppose df1 has a key b with values {1,2} and df2 also has a key b with values {3,4} then the result after inner join will be .. {(1,3), (1,4), (2,3), (2,4)}

-> but here we consider only the common keys

In [83]:
pd.merge(df1, df2, on='key', how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [91]:
print(left)
print("\n", right)

  key1   key2  lval
0  foo    one     1
1  foo    two     2
2  bar  three     3

   key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [89]:
pd.merge(left, right, on=['key1', 'key2'], how='inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5

### Right Index and Left Index

##### what does it mean ??

here if we put right_index = True .. we are saying that cosider right's index (row name) as key and move perform the join 


suppose df1 has keys = ['a', 'b', 'c'] and df2 index as [1,2] .. join operation will be performed using right_index = True and left_on = key .. but the result will be nothing like empty becz nothing is common

In [98]:
left1=pd.DataFrame({"key":["a","b","a","a","b","c"],
                   "value":pd.Series(range(6),dtype="Int64")})

right1=pd.DataFrame({"group_val":[3.5,7]}, index=["a","b"])

print(left1)
print("\n" , right1)

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

    group_val
a        3.5
b        7.0

In [99]:
pd.merge(left1, right1, left_on='key', how='inner', right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

### Concatenating Along Axis !

In [101]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [102]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [104]:
np.concatenate([arr, arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [106]:
s1= pd.Series([0,1], index=["a","b"],dtype="Int64")
print(s1)

s2=pd.Series([2,3,4],index=["c","d","e"],dtype="Int64")
print(s2)

s3=pd.Series([5,6],index=["f","g"],dtype="Int64")
print(s3)

a    0
b    1
dtype: Int64
c    2
d    3
e    4
dtype: Int64
f    5
g    6
dtype: Int64

In [107]:
pd.concat([s1,s2,s3], axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [108]:
pd.concat([s1,s2,s3], axis="rows")

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [118]:
a=pd.Series([np.nan,2.5,0.0,3.5,4.5,np.nan],
           index=["f","e","d","c","b","a"])

b=pd.Series([0.,np.nan,2.,np.nan,np.nan,5.,1.0],
           index=["a","b","c","d","e","f","a"])

print(a)

print("\n",b)

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

 a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
a    1.0
dtype: float64

In [119]:
a.combine_first(b)

a    0.0
a    1.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

##### combines_first 

this is essentially used to replace the NaN if it is present in the any df those are combined .. and replace it with the value in the other dataframe if present .. so suppose df1  has a : NaN and df2 has a : 0.o then it copies the 0.0 from df2 and puts the same in df1 for 'a'